In [1]:
#reminder last week axis=0 by row; axis=1 by column

In [2]:
#conda install pandas

In [3]:
#pandas library uses computational power of numpy and strucutral simplicty of R handling of dataframe
#pandas built on numpy

In [4]:
import pandas as pd
import numpy as np

In [5]:
#a numpy array in panda is called a panda series
labels=['a', 'b', 'c']
my_list=[10,20,30]
arr= np.array([10,20,30]) #same as in R c(10,20,30)
d={'a':10, 'b':20, 'c':30}

In [6]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [9]:
#can also convert to series from predefined dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [11]:
pd.Series([sum, print, len])
#can store different datatypes in a panda series
#apply all functions to one set of data

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [12]:
#New Series
series1 = pd.Series([1,2,3,4], index=['USA','Germany','Russia', 'Japan'])
series1

USA        1
Germany    2
Russia     3
Japan      4
dtype: int64

In [13]:
series2 = pd.Series([1,2,3,4,], index=['USA','Germany', 'Italy', 'Japan'])
series2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [14]:
series1 + series2

Germany    4.0
Italy      NaN
Japan      8.0
Russia     NaN
USA        2.0
dtype: float64

In [15]:
df = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[7,8,9]})
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [16]:
df = pd.DataFrame(np.random.randn(5,4), index=['A','B','C','D','E'], columns=['W','X','Y','Z'])

In [17]:
df

          W         X         Y         Z
A -0.422213 -0.286881  1.895946  0.598941
B -0.275020  0.194959 -0.698040 -0.460112
C  0.447442 -0.553824  0.660642 -0.994306
D  0.050715 -1.049848  0.400125  1.433209
E  0.557863 -0.953240 -1.008025 -0.270434

In [18]:
#data frame indexing
df['W']

A   -0.422213
B   -0.275020
C    0.447442
D    0.050715
E    0.557863
Name: W, dtype: float64

In [19]:
df[['W','Z']]

          W         Z
A -0.422213  0.598941
B -0.275020 -0.460112
C  0.447442 -0.994306
D  0.050715  1.433209
E  0.557863 -0.270434

In [20]:
#similar to '$' in R, pandas DataFrames can use '.'
df.W

A   -0.422213
B   -0.275020
C    0.447442
D    0.050715
E    0.557863
Name: W, dtype: float64

In [21]:
type(df['W'])

pandas.core.series.Series

In [22]:
#create new column in DataFrame by indexing new column name and the function that defines it
df['new']=df['W'] + df['Y']

In [23]:
df

          W         X         Y         Z       new
A -0.422213 -0.286881  1.895946  0.598941  1.473733
B -0.275020  0.194959 -0.698040 -0.460112 -0.973060
C  0.447442 -0.553824  0.660642 -0.994306  1.108084
D  0.050715 -1.049848  0.400125  1.433209  0.450840
E  0.557863 -0.953240 -1.008025 -0.270434 -0.450162

In [24]:
#deleting columns
#axis (row=0,column=1) axis=1 says its a column
df.drop('new', axis=1)
#axis is useful to refer to entire column of data manipulation
#axis much faster as well because refers to row exclusively rather than searching whole dataframe

          W         X         Y         Z
A -0.422213 -0.286881  1.895946  0.598941
B -0.275020  0.194959 -0.698040 -0.460112
C  0.447442 -0.553824  0.660642 -0.994306
D  0.050715 -1.049848  0.400125  1.433209
E  0.557863 -0.953240 -1.008025 -0.270434

In [25]:
#note: if you call df, it will still include the 'new' column because you dropped in command only, not redefined df
#instead of df = df.drop can use 'inplace' option
df.drop('new', axis=1, inplace=True)
df

          W         X         Y         Z
A -0.422213 -0.286881  1.895946  0.598941
B -0.275020  0.194959 -0.698040 -0.460112
C  0.447442 -0.553824  0.660642 -0.994306
D  0.050715 -1.049848  0.400125  1.433209
E  0.557863 -0.953240 -1.008025 -0.270434

In [26]:
#loc and iloc enable more powerful indexing
#loc uses locations to find
#iloc uses index to find

In [27]:
df.loc['A']

W   -0.422213
X   -0.286881
Y    1.895946
Z    0.598941
Name: A, dtype: float64

In [28]:
df.iloc[0]

W   -0.422213
X   -0.286881
Y    1.895946
Z    0.598941
Name: A, dtype: float64

In [29]:
df.loc['B','Y']

-0.6980395324486145

In [30]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.422213  1.895946
B -0.275020 -0.698040

In [31]:
#.loc similar to subset() in R

In [32]:
#conditional subsetting
df

          W         X         Y         Z
A -0.422213 -0.286881  1.895946  0.598941
B -0.275020  0.194959 -0.698040 -0.460112
C  0.447442 -0.553824  0.660642 -0.994306
D  0.050715 -1.049848  0.400125  1.433209
E  0.557863 -0.953240 -1.008025 -0.270434

In [33]:
df>0

       W      X      Y      Z
A  False  False   True   True
B  False   True  False  False
C   True  False   True  False
D   True  False   True   True
E   True  False  False  False

In [34]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  1.895946  0.598941
B       NaN  0.194959       NaN       NaN
C  0.447442       NaN  0.660642       NaN
D  0.050715       NaN  0.400125  1.433209
E  0.557863       NaN       NaN       NaN

In [35]:
#note: NaN denotes numpy missing values

In [36]:
df[df['W']>0]

          W         X         Y         Z
C  0.447442 -0.553824  0.660642 -0.994306
D  0.050715 -1.049848  0.400125  1.433209
E  0.557863 -0.953240 -1.008025 -0.270434

In [37]:
df[df['W']>0][['X','Y']]

          X         Y
C -0.553824  0.660642
D -1.049848  0.400125
E -0.953240 -1.008025

In [38]:
# & (and) amd | (or)
df[(df['X']>0) & (df['Y']<0)]

         W         X        Y         Z
B -0.27502  0.194959 -0.69804 -0.460112

In [39]:
#indexes can be easily reset in pandas
#to reset A-E indexes to default
df.reset_index()

  index         W         X         Y         Z
0     A -0.422213 -0.286881  1.895946  0.598941
1     B -0.275020  0.194959 -0.698040 -0.460112
2     C  0.447442 -0.553824  0.660642 -0.994306
3     D  0.050715 -1.049848  0.400125  1.433209
4     E  0.557863 -0.953240 -1.008025 -0.270434

In [40]:
new_index = 'CA NY WY OR CO'.split()
#same as new_index = ['CA','NY','WY','OR','CO']
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [41]:
df['States'] = new_index
df

          W         X         Y         Z States
A -0.422213 -0.286881  1.895946  0.598941     CA
B -0.275020  0.194959 -0.698040 -0.460112     NY
C  0.447442 -0.553824  0.660642 -0.994306     WY
D  0.050715 -1.049848  0.400125  1.433209     OR
E  0.557863 -0.953240 -1.008025 -0.270434     CO

In [42]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.422213 -0.286881  1.895946  0.598941
NY     -0.275020  0.194959 -0.698040 -0.460112
WY      0.447442 -0.553824  0.660642 -0.994306
OR      0.050715 -1.049848  0.400125  1.433209
CO      0.557863 -0.953240 -1.008025 -0.270434

In [43]:
df

          W         X         Y         Z States
A -0.422213 -0.286881  1.895946  0.598941     CA
B -0.275020  0.194959 -0.698040 -0.460112     NY
C  0.447442 -0.553824  0.660642 -0.994306     WY
D  0.050715 -1.049848  0.400125  1.433209     OR
E  0.557863 -0.953240 -1.008025 -0.270434     CO

In [45]:
df.set_index('States', inplace=True)
df

               W         X         Y         Z
States
CA     -0.422213 -0.286881  1.895946  0.598941
NY     -0.275020  0.194959 -0.698040 -0.460112
WY      0.447442 -0.553824  0.660642 -0.994306
OR      0.050715 -1.049848  0.400125  1.433209
CO      0.557863 -0.953240 -1.008025 -0.270434

In [ ]:
#hierarchal multi-indexed dataframes

In [48]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [49]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [ ]:
#create dataframe using these tuples as an index

In [50]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A','B'])

In [51]:
df

             A         B
G1 1  0.134613  0.251930
   2  0.116406  1.295797
   3 -0.315277 -0.559347
G2 1 -0.876699  0.061857
   2 -0.727136  0.720496
   3  1.070665 -0.551065

In [53]:
#pull out first level only
df.loc['G1']

          A         B
1  0.134613  0.251930
2  0.116406  1.295797
3 -0.315277 -0.559347

In [54]:
df.loc['G1'].loc[1]

A    0.134613
B    0.251930
Name: 1, dtype: float64

In [55]:
#gives attributes
df.index.names

FrozenList([None, None])

In [56]:
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1    0.134613  0.251930
      2    0.116406  1.295797
      3   -0.315277 -0.559347
G2    1   -0.876699  0.061857
      2   -0.727136  0.720496
      3    1.070665 -0.551065

In [57]:
#instead of loc.loc use xs()
df.xs('G1')

            A         B
Num
1    0.134613  0.251930
2    0.116406  1.295797
3   -0.315277 -0.559347

In [58]:
df.xs(['G1',1])

A    0.134613
B    0.251930
Name: (G1, 1), dtype: float64

In [59]:
df.xs(1, level='Num')

              A         B
Group
G1     0.134613  0.251930
G2    -0.876699  0.061857